tymaker/STM32_32x32_rgb_matrix/USER/matrixman-master/matrixman-gamefile.c
/*--------------------------
| This is the main game file which is shared between the
| master (teensy 3.1) and game_abstraction (which uses
| SDL2 to emulate the hardware) branch. This file should
| always be the same between the two branches, which will
| allow for greater portability and for game development
| when the hardware is not present.
|
| Merging between two is explained here:
| http://jasonrudolph.com/blog/2009/02/25/git-tip-how-to-merge-specific-files-from-another-branch/
|
| checkout the branch you want to merge changes into then use:
| git checkout <<branch-name-with-changes>> matrixman.c
| git status
| git commit -m "'Merge' changes from 'branch-name-with-changes'"
----------------------------------------------*/

#include "matrixman.h"
#include <stdio.h>
#include <stdlib.h>
#include <inttypes.h>
#include "board.h"
#include "dots.h"
#include "player.h"
#include "stm32f10x_rgb_matrix.h"
#include "stm32f10x_rgb_adc.h"
#include "stm32f10x_rgb_appliction.h"

uint32_t dotTracker[36];

#define TRUE 1
#define FALSE 0

//Player Variables
Player myGuy;
Player enemy1;
Player enemy2;
Player enemy3;
Player enemy4;

uint8_t enemyMode;      //SCATTER, CHASE, or FRIGHT
uint8_t gameRunning;    //TRUE unles game over: FALSE
uint16_t frightTimer;   //Counts down to end of FRIGHT mode
uint8_t lastBehavior;   //Saves mode before entering FRIGHT
uint16_t dotTimer;      //Countdown release enemies if dots not eaten
uint16_t level;         //Which level is currently running (zero index)
uint8_t nextDir;        //Stores the newest direction input from user
uint8_t powerPixelColor;    //Used to facilitate flashing of the powerPixels
int8_t lives;          //Remaining extra lives
uint16_t behaviorTicks; //Timer for switch from scatter to chase
uint8_t behaviorIndex;  //Index that tracks timer values for mode changes
uint8_t useGlobalDot;       //FALSE = use enemy dot counters, TRUE = use globalDotCounter
uint16_t globalDotCounter;  // after death, release ghosts on dots eaten: 7/17/32
uint32_t score;         //Keeps score
#define EATENEMYSCOREBASE   200                 //The least you'll get for eating enemy
uint16_t eatNextEnemyScore = EATENEMYSCOREBASE; //Doubles with each enemy eaten
//extern u8 aaa;
//enemyMode types
#define SCATTER 0
#define CHASE 1
#define FRIGHT 2

static const uint16_t behaviors[] = {
    //In milliseconds
    7000, 20000, 7000, 20000, 5000, 20000, 10, 0 //trailing zero is a hack
    //TODO: add more behaviors for advancing levels (seriously that's never going to happen)
};

//Enemy Data
const uint8_t playerColor[5] = { YELLOW, RED, PINK, CYAN, ORANGE };
const uint8_t startingX[5] = { 15, 15, 17, 17, 14 };
const uint8_t startingY[5] = { 26, 14, 16, 17, 17 };
    //Player doesn't have scatter so 0 index is retreat coordinates
const uint8_t scatterX[5] = { 15, 27, 4, 2, 29 };
const uint8_t scatterY[5] = { 14, 0, 0, 35, 35 };

/*TODO: Level change: Player and enemy speed changes
    100% = 10/second = 100ms ticks
    17ms speed penalty per dot gobbled
    50ms speed penalty for power pellet

                player  fright  enemy   fright  tunnel
    Level 1     80% 125 90% 111 75% 133 50% 200 40% 250
    Level 2-4   90% 111 95% 105 85% 118 55% 182 45% 222
    Level 5-20      100     100 95% 105 60% 167 50% 200
    Level 21+   90% 111     111 95% 105     105 50% 200
*/

/* Speed is indexed as follows: [(level * 5) + <index>]
    <index>: Player, Enemy, PlayerFright, EnemyFright, EnemyTunnel */
const uint16_t speed[] = {  125, 133, 111, 200, 250,
                            111, 118, 105, 182, 222,
                            100, 105, 100, 167, 200,
                            111, 105, 111, 105, 200
                            };

const uint8_t dotLimitTable[] = { 0, 0, 0, 30, 60,
                                0, 0, 0, 0, 50 };


//Index values for the speed array
#define SPEEDPLAYER         0
#define SPEEDENEMY          1
#define SPEEDPLAYERFRIGHT   2
#define SPEEDENEMYFRIGHT    3
#define SPEEDENEMYTUNNEL    4

//PowerPixel rows and columns
#define PP1COL    3
#define PP2COL    28
#define PP1ROW    6
#define PP2ROW    26


/*---- Prototypes ----*/
void enterHouse(Player *pawn);
void changeBehavior(Player *pawn, uint8_t mode);
void changeSpeed(Player *pawn, uint8_t index);
void refreshDotTracker(void);
void drawLives(void);
void drawScore(void);

//Function returns 1 if next move is not a collision with the board
uint8_t canMove(uint8_t nextX, uint8_t nextY) {
    if (board[nextY] & (1<<(31-nextX))) {
        return FALSE;
    }
    else return TRUE;
}

void gobbleCount(void) {
    myGuy.dotCount += 1;
    if (myGuy.dotCount == 244) {
        //All dots have been eaten, time for next level
        gameRunning = FALSE;
        return;
    }
    dotTimer = 0;   //Reset timer

    if (useGlobalDot) {
        if (globalDotCounter <= 32) { ++globalDotCounter; }
    }
    else {
        if (enemy1.inPlay == FALSE) {
            enemy1.dotCount += 1;
            return;
        }
        if (enemy2.inPlay == FALSE) {
            enemy2.dotCount += 1;
            return;
        }
        if (enemy3.inPlay == FALSE) {
            enemy3.dotCount += 1;
            return;
        }
        if (enemy4.inPlay == FALSE) {
            enemy4.dotCount += 1;
            return;
        }
    }
}

uint8_t isPixel(uint8_t x, uint8_t y) {
    if (dotTracker[y] & 1<<(31-x)) { return TRUE; }
    return FALSE;
}

uint8_t isPowerPixel(uint8_t x, uint8_t y) {
    if ((x == PP1COL) || (x == PP2COL)) {
        if ((y == PP1ROW) || (y == PP2ROW)) {
            return TRUE;
        }
    }
    return FALSE;
}

void movePlayer(Player *pawn) {
    uint8_t testX = pawn->x;
    uint8_t testY = pawn->y;

    if ((pawn->color == GREEN) && (pawn->x == scatterX[0]) && (pawn->y == scatterY[0])) {
        //Gobbled enemy has made it home, put it in the house
        displayPixel(pawn->x, pawn->y, BLACK);
        enterHouse(pawn);
        displayPixel(pawn->x, pawn->y, pawn->color);
        displayLatch(); //redraws display (if necessary)
        return;
    }
    else {
        switch (pawn->travelDir) {
            case UP:
                testY--;
                break;
            case DOWN:
                testY++;
                break;
            case LEFT:
                testX--;
                break;
            case 3:
                testX++;
                break;
        }
    }

    //is next space unoccupied?
    if (canMove(testX, testY)) {
        //erase player at current spot (redraw dot if necessary)
        if (isPixel(pawn->x, pawn->y)) { 
            if (isPowerPixel(pawn->x, pawn->y)) { displayPixel(pawn->x, pawn->y, WHITE); }
            else { displayPixel(pawn->x, pawn->y, GREY); }
        }
        else { displayPixel(pawn->x, pawn->y, BLACK); }
        //Tunnel Tests
        if (testY == 17) {
            if (testX == 1) { testX = 29; } //Warp left to right
            else if (testX == 30) { testX = 2; } //Warp right to left
            else if ((pawn->id) && (pawn->travelDir == LEFT)) {
                if (testX == 7) { pawn->speedMode = SPEEDENEMYTUNNEL; } //Slow down
                if (testX == 23) {
                    //Speed Up
                    if (enemyMode != FRIGHT) { pawn->speedMode = SPEEDENEMY; }
                    else { pawn->speedMode = SPEEDENEMYFRIGHT; }
                }
            }
            else if ((pawn->id) && (pawn->travelDir == RIGHT)) {
                if (testX == 24) {pawn->speedMode = SPEEDENEMYTUNNEL; } //Slow down
                if (testX == 8) {
                    //Speed Up
                    if (enemyMode != FRIGHT) { pawn->speedMode = SPEEDENEMY; }
                    else { pawn->speedMode = SPEEDENEMYFRIGHT; }
                }
            }
        }
        //increment player position
        pawn->x = testX;
        pawn->y = testY;
        //redraw player at new spot
        displayPixel(pawn->x, pawn->y, pawn->color);
        //gobble the dot
        if ((pawn == &myGuy) && isPixel(pawn->x,pawn->y)) {
            dotTracker[pawn->y] &= ~(1<<(31-pawn->x));  //Remove dot from the board
            score += 10;
            drawScore();
            gobbleCount();  //Increment dotCounts
            //There is a speed hit for each dot
            pawn->speed += 17;  // ~1/60th of a second
            if (isPowerPixel(pawn->x, pawn->y)) {
                //Additional speed hit for PowerPixels
                pawn->speed += 33;  // ~ 2/60th of a second
                //Additional points for gobbling this powerPixel
                score += 40;
                drawScore();
                /*---Switch to Fright mode---*/
                //Save last mode but don't if last mode was FRIGHT
                if (enemyMode != FRIGHT) { lastBehavior = enemyMode; }
                enemyMode = FRIGHT;
                frightTimer = 6000; //TODO: This should change with each level
                //Reset eatNextEnemyScore to default
                eatNextEnemyScore = EATENEMYSCOREBASE;

                changeBehavior(&myGuy, enemyMode);
                changeBehavior(&enemy1, enemyMode);
                changeBehavior(&enemy2, enemyMode);
                changeBehavior(&enemy3, enemyMode);
                changeBehavior(&enemy4, enemyMode);
            }
        }
    }
    displayLatch(); //Redraw display (if necessary);
}

