tymaker/STM32_32x32_rgb_matrix/USER/matrixman-master/matrixman-gamefile.c
            //setX
            tempNum = myGuy.x - (enemy1.x - myGuy.x);
            if (tempNum < 0) { tempNum = 0; }
            if (tempNum > 31) { tempNum = 31; }
            enemy3.tarX = (uint8_t)tempNum;

            //setY
            tempNum = myGuy.y - (enemy1.y - myGuy.y);
            if (tempNum < 0) { tempNum = 0; }
            if (tempNum > 35) { tempNum = 35; }
            enemy3.tarY = (uint8_t)tempNum;
            break;

        case 4:
            /*--------------- Enemy4 ------------------*/
            if (getDistance(enemy4.x, enemy4.y, myGuy.x, myGuy.y) > 64) {
                enemy4.tarX = myGuy.x;
                enemy4.tarY = myGuy.y;
            }
            else {
                enemy4.tarX = scatterX[enemy4.id];
                enemy4.tarY = scatterY[enemy4.id];
            }
            break;
    }
}

void checkDots(Player *pawn, uint8_t force) {
    uint8_t releaseEnemy = FALSE;
    if (pawn->inPlay == TRUE) { return; }   //Do nothing if enemy already in play
    if (force == TRUE) { releaseEnemy = TRUE; }
    else if (useGlobalDot) {
        //These global dot thresholds are always the same
        if ((pawn->id == 2) && globalDotCounter >= 7) { releaseEnemy = TRUE; }
        if ((pawn->id == 3) && globalDotCounter >= 17) { releaseEnemy = TRUE; }
        if ((pawn->id == 4) && globalDotCounter >= 32) { releaseEnemy = TRUE; }
    }
    else if (pawn->dotCount >= pawn->dotLimit) { releaseEnemy = TRUE; }

    if (releaseEnemy) {
        displayPixel(pawn->x, pawn->y, BLACK); //erase current locaiton
        pawn->x = 18;
        pawn->y = 14;
        displayPixel(pawn->x, pawn->y, pawn->color); //Draw new locaiton
        displayLatch(); //Redraw display (if necessary)
        pawn->inPlay = TRUE;
        pawn->travelDir = LEFT; //TODO: shouldn't need to reset direction here
    }
}

void setupPlayer(Player *pawn, uint8_t newId) {
    pawn->id = newId;
    pawn->x = startingX[pawn->id];
    pawn->y = startingY[pawn->id];
    if (newId) { changeSpeed(pawn, SPEEDENEMY); }
    else { changeSpeed(pawn, SPEEDPLAYER); }
    pawn->travelDir = LEFT;
    pawn->color = playerColor[pawn->id];
    pawn->tarX = scatterX[pawn->id];
    pawn->tarY = scatterY[pawn->id];
    pawn->dotCount = 0;
    if (level >= 3) { pawn->dotLimit = 0; }
    else { pawn->dotLimit = dotLimitTable[(level*5)+pawn->id]; }
    pawn->inPlay = FALSE;
}

void setupPlayerAfterDeath(Player *pawn) {
    pawn->x = startingX[pawn->id];
    pawn->y = startingY[pawn->id];
    if (pawn->id) { changeSpeed(pawn, SPEEDENEMY); }
    else { changeSpeed(pawn, SPEEDPLAYER); }
    pawn->travelDir = LEFT;
    pawn->color = playerColor[pawn->id];
    pawn->tarX = scatterX[pawn->id];
    pawn->tarY = scatterY[pawn->id];
    pawn->inPlay = FALSE;
}

void reverseDir(Player *pawn) {
    switch(pawn->travelDir) {
        case UP:
            pawn->travelDir = DOWN;
            break;
        case DOWN:
            pawn->travelDir = UP;
            break;
        case LEFT:
            pawn->travelDir = RIGHT;
            break;
        case 3:
            pawn->travelDir = LEFT;
            break;
    }
}

void setScatterTar(Player *pawn) {
    pawn->tarX = scatterX[pawn->id];
    pawn->tarY = scatterY[pawn->id];
}

void changeSpeed(Player *pawn, uint8_t index) {
    uint8_t rowOffset;
    if (level == 0) { rowOffset = 0; }
    else if ((level >= 1) && (level <= 3)) { rowOffset = 5; }
    else if ((level >= 4) && (level <= 19)) { rowOffset = 10; }
    else { rowOffset = 15; }

    pawn->speed = speed[index + rowOffset];
}

void changeBehavior(Player *pawn, uint8_t mode) {
    //GREEN means enemy is in retreat mode; do nothing
    if (pawn->color == GREEN) { return; }

    if ((enemyMode != FRIGHT) && (pawn->id)) { 
        //Enemies should reverse current direction when modes change
        //Unless coming out of FRIGHT mode
        reverseDir(pawn);

        //Not FRIGHT mode so revive natural color
        pawn->color = playerColor[pawn->id];
    }

    switch(mode) {
        case SCATTER:
            //Change Speed
            if (pawn->id == 0) { pawn->speedMode = SPEEDPLAYER; return; }
            pawn->speedMode = SPEEDENEMY;
            //Change Targets
            setScatterTar(pawn);
            break;
        case CHASE:
            //Change Speed
            if (pawn->id == 0) { pawn->speedMode = SPEEDPLAYER; return; }
            pawn->speedMode = SPEEDENEMY;
            break;
        case FRIGHT:
            //Change speeds
            if (pawn->id == 0) { pawn->speedMode = SPEEDPLAYERFRIGHT; return; }
            pawn->speedMode = SPEEDENEMYFRIGHT;
            //Fix colors
            pawn->color = LAVENDAR;
            break;
    }
}

uint8_t wasEaten(Player *player, Player *pawn) {
    if (pawn->color == GREEN) { return FALSE; } //GREEN is enemy in retreat -- no collision
    if ((player->x == pawn->x) && (player->y == pawn->y)) { return TRUE; }
    return FALSE;
}

void performRetreat(Player *pawn) {
    /*TODO: Each player should have enemyMode setting
        and it should be checked here */
    //Add to the score and double the next score
    score += eatNextEnemyScore;
    eatNextEnemyScore = eatNextEnemyScore * 2;
    drawScore();

    pawn->color = GREEN;
    pawn->tarX = scatterX[0];
    pawn->tarY = scatterY[0];
}

void enterHouse(Player *pawn) {
    /*TODO: Each player should have enemyMode setting
        and it should be changed here */
    pawn->color = playerColor[pawn->id];
    pawn->x = scatterX[0];
    pawn->y = scatterY[0]+2;
    pawn->tarX = scatterX[pawn->id];
    pawn->tarY = scatterY[pawn->id];
    pawn->inPlay = FALSE;
}

void checkEaten(void) {
    if (enemyMode != FRIGHT) {
        if (wasEaten(&myGuy, &enemy1) ||
            wasEaten(&myGuy, &enemy2) ||
            wasEaten(&myGuy, &enemy3) ||
            wasEaten(&myGuy, &enemy4))
        {
            //Game over
            gameRunning = FALSE;
            if (lives == 0) {
                //Display gameover message
                displayGameOver();
            }
        }
    }
    else {
        //Enemies should change color and go home when eaten
        if (wasEaten(&myGuy, &enemy1) && (enemy1.color != GREEN)) { performRetreat(&enemy1); }
        if (wasEaten(&myGuy, &enemy2) && (enemy2.color != GREEN)) { performRetreat(&enemy2); }
        if (wasEaten(&myGuy, &enemy3) && (enemy3.color != GREEN)) { performRetreat(&enemy3); }
        if (wasEaten(&myGuy, &enemy4) && (enemy4.color != GREEN)) { performRetreat(&enemy4); }
    }
}

void flashEnemy(Player *pawn, uint8_t color) {
    if ((pawn->color == WHITE) || (pawn->color == LAVENDAR)) {
        pawn->color = color;
        displayPixel(pawn->x, pawn->y, pawn->color);
        displayLatch(); //redraws display (if necessary)
    }
}

void expiredDotTimer(void) {
    //Too long since a dot was eaten, release an enemy if you canMove
    dotTimer = 0;   //Reset timer

    //Will try releasing the high priority enemy and return if successful
    if (enemy1.inPlay == FALSE) { checkDots(&enemy1, TRUE); return; }
    if (enemy2.inPlay == FALSE) { checkDots(&enemy2, TRUE); return; }
    if (enemy3.inPlay == FALSE) { checkDots(&enemy3, TRUE); return; }
    if (enemy4.inPlay == FALSE) { checkDots(&enemy4, TRUE); return; }
}

void enemyTick(Player *pawn) {
    if (--pawn->speed == 0) {
        setTarget(pawn);
        routeChoice(pawn);
        movePlayer(pawn);
        checkEaten();
        changeSpeed(pawn, pawn->speedMode);
    }
}

void playerTick(Player * pawn) {
    if (--pawn->speed == 0) {
        playerRoute(&myGuy, nextDir);
        /*NOTE: changeSpeed must be called before
            movePlayer because the dot eaten timer
            penalty is added to the speed counter */
        changeSpeed(pawn, pawn->speedMode);
        movePlayer(&myGuy);
        checkEaten();
    }
}

void setupLevel(void) {
    //Call this to redraw level
    //All current setting for dots and players are used

    //Draw the board
    uint16_t i; //Arduino IDE not set for c99 by default; booo!
    uint16_t j; //Arduino IDE not set for c99 by default; booo!
    for (i = 2; i < 34; i++) {
        for (j = 0; j<32; j++) {
            if (board[i] & (1<<(31-j))) {    //Invert the x (big endian)
                displayPixel(j, i, BLUE); 
            }
        }
    }

    //Draw the dots
    for (i = 2; i < 34; i++) {
        for (j = 0; j<32; j++) {
            if (dotTracker[i] & (1<<(31-j))) {    //Invert the x (big endian)
                if (isPowerPixel(j,i)) { displayPixel(j, i, WHITE); }
                else { displayPixel(j, i, GREY); }
            }
        }
    }

    //Draw the player
    displayPixel(myGuy.x, myGuy.y, myGuy.color);

