tymaker/STM32_32x32_rgb_matrix/USER/matrixman-master/matrixman-gamefile.c
    drawLives();

    displayLatch(); //Redraws display (if necessary)
}

void setupDefaults(void) {
    refreshDotTracker();
    //set initial values for player and enemies
    setupPlayer(&myGuy,0);
    setupPlayer(&enemy1,1);
    enemy1.inPlay = TRUE; //Enemy1 always starts inPlay
    setupPlayer(&enemy2,2);
    setupPlayer(&enemy3,3);
    setupPlayer(&enemy4,4);
    enemyMode = SCATTER;
    useGlobalDot = FALSE;
}

void deathRestart(void) {
    //Reset behavioral timer and index
    behaviorIndex = 0;
    behaviorTicks = 0;

    //set initial values for player and enemies
    setupPlayerAfterDeath(&myGuy);
    setupPlayerAfterDeath(&enemy1);
    enemy1.inPlay = TRUE; //Enemy1 always starts inPlay
    setupPlayerAfterDeath(&enemy2);
    setupPlayerAfterDeath(&enemy3);
    setupPlayerAfterDeath(&enemy4);
    enemyMode = SCATTER;
    useGlobalDot = TRUE;
}

void refreshDotTracker(void) {
    //Copy dots from the static array
    uint16_t j; //Arduino IDE not set for c99 by default; booo!
    //Get Dot-tracking array ready
    uint8_t i; //Arduino IDE not set for c99 by default; booo!
    for (i=0; i<36; i++) {
        dotTracker[i] = 0x00000000;
    }
    for (j = 2; j < 34; j++) { dotTracker[j] = dots[j]; }
}

void drawLives(void) {
    int8_t i; //Arduino IDE not set for c99 by default; booo!
    for (i=0; i<(lives); i++) {
        displayPixel(0, 33-(i*2), YELLOW);
    }
}

void drawScore(void) {
    int8_t i; //Arduino IDE not set for c99 by default; booo!
    for (i=0; i<32; i++) {
        if (score & (1<<i)) { displayPixel(31, 33-i, WHITE); }
        else { displayPixel(31, 33-i, BLACK); }
    }
}

int playMatrixman()
{
    uint8_t programRunning = TRUE;
    //TODO: Level change: Update dot counters by level

    //TODO: PowerPixel blink
    //TODO: bonus food
    /*TODO: When enemy in fright mode is eaten and makes it back to house:
        1) It should emerge as a danger to player (can be re-eaten)
        2) Does it go back into SCATTER/CHASE mode?
        3) Retreating should be at highest speed
    */

    level = 0;
    lives = 2;  //Including the one in play
    setupDefaults();
    //initDisplay();
    //initControl();
    setupLevel();       //show everything on the display

    gameRunning = TRUE;
    behaviorTicks = 0;
    behaviorIndex = 0;
    nextDir = RIGHT;
    dotTimer = 0;
    score = 0;

    while (programRunning)
    {

        //TODO: This is all input code which need to change when ported

        /*---- User Input ----*/
        uint8_t control = getControl();
        switch (control) {
            case NOINPUT:
                break;
            case ESCAPE:
                gameRunning = FALSE;
                programRunning = FALSE;
                continue;
            case BUTTON:
                if (gameRunning == FALSE) {
                    gameRunning = TRUE;
                    behaviorTicks = 0;
                    behaviorIndex = 0;
                    nextDir = RIGHT;
                    dotTimer = 0;
                    score = 0;
                    setupDefaults();
                    lives = 2;
                    setupLevel();       //show everything on the display
                }
                break;
            default:
                nextDir = control; 
        }

        if (gameRunning) {

            /* This animates the game */

            //Switch Modes
            if (enemyMode == FRIGHT) {
                --frightTimer;
                /*-- This Block Flashes the enemies coming out of FRIGHT mode --*/
                if (frightTimer <= 1800) {
                    if (frightTimer%200 == 0) {
                        uint8_t flashColor;
                        if ((frightTimer/200)%2) {
                            //1800 1400 1000 600 200
                            flashColor = WHITE;
                        }
                        else {
                            //1600 1200 800 4000 0
                            flashColor = LAVENDAR;
                        }
                        flashEnemy(&enemy1, flashColor);
                        flashEnemy(&enemy2, flashColor);
                        flashEnemy(&enemy3, flashColor);
                        flashEnemy(&enemy4, flashColor);
                    }
                }
                //Leave fright mode when timer expires
                if (frightTimer == 0) { enemyMode = lastBehavior; }

                changeBehavior(&myGuy, enemyMode);
                changeBehavior(&enemy1, enemyMode);
                changeBehavior(&enemy2, enemyMode);
                changeBehavior(&enemy3, enemyMode);
                changeBehavior(&enemy4, enemyMode);
            }
            //Switch between SCATTER and CHASE depending on level paramaters
            //This is an else statement so that the timer doesn't run during FRIGHT mode
            else if (behaviorTicks++ > behaviors[behaviorIndex]) {
                if (behaviors[behaviorIndex] > 0) {
                    //Checking for 0 lets us run final behavior forever
                    behaviorIndex++;
                    behaviorTicks = 0;

                    if (behaviorIndex % 2) { enemyMode = CHASE; }
                    else { enemyMode = SCATTER; }

                    changeBehavior(&myGuy, enemyMode);
                    changeBehavior(&enemy1, enemyMode);
                    changeBehavior(&enemy2, enemyMode);
                    changeBehavior(&enemy3, enemyMode);
                    changeBehavior(&enemy4, enemyMode);
                }
            }

            //decrement counter and check for trigger
            //set target or take user input
            //choose route
            //movePiece
            //checkEaten

            if (gameRunning) { enemyTick(&enemy1); }
            if (gameRunning) { enemyTick(&enemy2); }
            if (gameRunning) { enemyTick(&enemy3); }
            if (gameRunning) { enemyTick(&enemy4); }

            if (gameRunning) { playerTick(&myGuy); }

            //Enemy dot counters
            checkDots(&enemy1, FALSE);
            checkDots(&enemy2, FALSE);
            checkDots(&enemy3, FALSE);
            checkDots(&enemy4, FALSE);

            if (dotTimer++ >= 4000) {
                //TODO: this time limit should change to 3000 at lvl5+
                expiredDotTimer();
            }

            controlDelayMs(1);
            /* End of game animation */
        }

        //Restart if necessary
        if (myGuy.dotCount == 244) {
            //get new level ready
            ++level;
            displayClear(BLACK);
            setupDefaults();
            setupLevel();
            gameRunning = TRUE;
        }
        else if (lives && gameRunning == FALSE) {
            //Life lost, restart this level
            --lives;
            //TODO: Pause after a life is lost
            displayClear(BLACK);
            deathRestart();
            drawScore();
            setupLevel();
            gameRunning = TRUE;
        }
			if(checkForTermination()){
				ClearBuff(0,1023);
				break;
			}
   }
    displayClose();
    return 0;
}

void displayPixel(uint8_t x, uint8_t y, char color) {
	  drawPixel(x,y-2,0x00);
    drawPixel(x,y-2,Color888(colors[color][0],colors[color][1],colors[color][2]));
}

void controlDelayMs(uint16_t ms) {
  delay(ms); 
}

void displayClose(void) {

}

void displayGameOver(void) {
    setScrollOffsetFromEdge(13);
    setScrollMode(wrapForward);
    scrollText("Game Over", 1);
    while(getScrollStatus() > 0) { }
}

void displayClear(u8 Color){
  ClearBuff(0,1023);
}

void displayLatch(void) {
    //swapBuffers();
}

uint8_t getControl(void) {
	/*u8 aa;
	if(aaa == 'w')
		aa=0;
	else if(aaa == 's')
		aa=1;
	else if(aaa == 'a')
		aa=2;
	else if(aaa == 'd')
		aa=3;
	return aa;*/
	return random(1,3);
}

